$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '13.2.0',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'file_io.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'pldm.h' => 1,
                         'pldm_types.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.8.0',
          'LibraryVersion' => '0.8.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'af-mctp.c' => 1,
                         'bios_table.c' => 1,
                         'instance-id.c' => 1,
                         'mctp-demux.c' => 1,
                         'pdr.c' => 1
                       },
          'SymbolInfo' => {
                            '1303' => {

                                                 'pldm_pdr_find_record_by_type' => 1,
                                                 'pldm_pdr_fru_record_set_find_by_rsi' => 1,
                                                 'pldm_pdr_get_next_record' => 1,
                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_get_terminus_handle' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'pldm_transport_af_mctp_bind' => 1,
                                                 'pldm_transport_af_mctp_core' => 1,
                                                 'pldm_transport_af_mctp_destroy' => 1,
                                                 'pldm_transport_af_mctp_init' => 1,
                                                 'pldm_transport_af_mctp_init_pollfd' => 1,
                                                 'pldm_transport_af_mctp_map_tid' => 1,
                                                 'pldm_transport_af_mctp_unmap_tid' => 1,
                                                 'pldm_transport_mctp_demux_core' => 1,
                                                 'pldm_transport_mctp_demux_destroy' => 1,
                                                 'pldm_transport_mctp_demux_init' => 1,
                                                 'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                 'pldm_transport_mctp_demux_map_tid' => 1,
                                                 'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                 'pldm_transport_poll' => 1,
                                                 'pldm_transport_recv_msg' => 1,
                                                 'pldm_transport_send_msg' => 1,
                                                 'pldm_transport_send_recv_msg' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '46' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '53' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '60' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '67' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '74' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '81' => {
                                    'BaseType' => '46',
                                    'Header' => 'types.h',
                                    'Line' => '38',
                                    'Name' => '__uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '93' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '100' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '107' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '114' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '121' => {
                                     'BaseType' => '81',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '133' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '175' => {
                                     'BaseType' => '121',
                                     'Header' => 'base.h',
                                     'Line' => '16',
                                     'Name' => 'pldm_tid_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '187' => {
                                     'BaseType' => '121',
                                     'Header' => 'instance-id.h',
                                     'Line' => '13',
                                     'Name' => 'pldm_instance_id_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '199' => {
                                     'Header' => 'responder.h',
                                     'Line' => '10',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'tid',
                                                          'offset' => '0',
                                                          'type' => '175'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance_id',
                                                          'offset' => '1',
                                                          'type' => '187'
                                                        },
                                                 '2' => {
                                                          'name' => 'type',
                                                          'offset' => '2',
                                                          'type' => '121'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '3',
                                                          'type' => '121'
                                                        },
                                                 '4' => {
                                                          'name' => 'next',
                                                          'offset' => '8',
                                                          'type' => '279'
                                                        }
                                               },
                                     'Name' => 'struct pldm_responder_cookie',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '279' => {
                                     'BaseType' => '199',
                                     'Name' => 'struct pldm_responder_cookie*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '284' => {
                                     'Header' => 'pldm.h',
                                     'Line' => '15',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLDM_REQUESTER_SUCCESS',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                          'value' => '18446744073709551615 (-1)'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                          'value' => '18446744073709551614 (-2)'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                          'value' => '18446744073709551613 (-3)'
                                                        },
                                                 '4' => {
                                                          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                          'value' => '18446744073709551612 (-4)'
                                                        },
                                                 '5' => {
                                                          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                          'value' => '18446744073709551611 (-5)'
                                                        },
                                                 '6' => {
                                                          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                          'value' => '18446744073709551610 (-6)'
                                                        },
                                                 '7' => {
                                                          'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                          'value' => '18446744073709551609 (-7)'
                                                        },
                                                 '8' => {
                                                          'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                          'value' => '18446744073709551608 (-8)'
                                                        },
                                                 '9' => {
                                                          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                          'value' => '18446744073709551607 (-9)'
                                                        },
                                                 '10' => {
                                                           'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                           'value' => '18446744073709551606 (-10)'
                                                         },
                                                 '11' => {
                                                           'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                           'value' => '18446744073709551605 (-11)'
                                                         },
                                                 '12' => {
                                                           'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                           'value' => '18446744073709551604 (-12)'
                                                         },
                                                 '13' => {
                                                           'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                           'value' => '18446744073709551603 (-13)'
                                                         }
                                               },
                                     'Name' => 'enum pldm_requester_error_codes',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '805' => {
                                     'Name' => '_Bool',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '927' => {
                                     'BaseType' => '53',
                                     'Header' => 'types.h',
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '951' => {
                                     'BaseType' => '60',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '970' => {
                                     'BaseType' => '107',
                                     'Header' => 'types.h',
                                     'Line' => '194',
                                     'Name' => '__ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '982' => {
                                     'BaseType' => '114',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1006' => {
                                      'BaseType' => '121',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '1011' => {
                                      'BaseType' => '927',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1023' => {
                                      'BaseType' => '951',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1035' => {
                                      'Header' => 'pldm_types.h',
                                      'Line' => '25',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'alpha',
                                                           'offset' => '0',
                                                           'type' => '121'
                                                         },
                                                  '1' => {
                                                           'name' => 'update',
                                                           'offset' => '1',
                                                           'type' => '121'
                                                         },
                                                  '2' => {
                                                           'name' => 'minor',
                                                           'offset' => '2',
                                                           'type' => '121'
                                                         },
                                                  '3' => {
                                                           'name' => 'major',
                                                           'offset' => '3',
                                                           'type' => '121'
                                                         }
                                                },
                                      'Name' => 'struct pldm_version',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '1093' => {
                                      'BaseType' => '1035',
                                      'Header' => 'pldm_types.h',
                                      'Line' => '30',
                                      'Name' => 'ver32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1105' => {
                                      'BaseType' => '1093',
                                      'Name' => 'ver32_t const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '1145' => {
                                      'BaseType' => '67',
                                      'Header' => 'stddef.h',
                                      'Line' => '214',
                                      'Name' => 'size_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1207' => {
                                      'BaseType' => '970',
                                      'Header' => 'types.h',
                                      'Line' => '108',
                                      'Name' => 'ssize_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1219' => {
                                      'BaseType' => '1006',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2228' => {
                                      'BaseType' => '1105',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2341' => {
                                      'BaseType' => '2346',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2346' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '2579' => {
                                      'BaseType' => '1',
                                      'Name' => 'void*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2593' => {
                                      'BaseType' => '114',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '2622' => {
                                      'Header' => 'pldm_types.h',
                                      'Line' => '9',
                                      'Name' => 'anon-struct-pldm_types.h-9',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '2776' => {
                                      'Header' => 'pldm_types.h',
                                      'Line' => '19',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'byte',
                                                           'offset' => '0',
                                                           'type' => '121'
                                                         },
                                                  '1' => {
                                                           'name' => 'bits',
                                                           'offset' => '0',
                                                           'type' => '2622'
                                                         }
                                                },
                                      'Name' => 'union bitfield8_t',
                                      'Size' => '1',
                                      'Type' => 'Union'
                                    },
                          '2788' => {
                                      'BaseType' => '2776',
                                      'Name' => 'bitfield8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '3191' => {
                                      'Header' => 'base.h',
                                      'Line' => '92',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'PLDM_RESPONSE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'PLDM_REQUEST',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'PLDM_RESERVED',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum MessageType',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3203' => {
                                      'Header' => 'base.h',
                                      'Line' => '138',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'command',
                                                           'offset' => '2',
                                                           'type' => '121'
                                                         }
                                                },
                                      'Name' => 'struct pldm_msg_hdr',
                                      'Size' => '3',
                                      'Type' => 'Struct'
                                    },
                          '3314' => {
                                      'BaseType' => '3203',
                                      'Name' => 'struct pldm_msg_hdr const',
                                      'Size' => '3',
                                      'Type' => 'Const'
                                    },
                          '3319' => {
                                      'Header' => 'base.h',
                                      'Line' => '171',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'hdr',
                                                           'offset' => '0',
                                                           'type' => '3203'
                                                         },
                                                  '1' => {
                                                           'name' => 'payload',
                                                           'offset' => '3',
                                                           'type' => '3364'
                                                         }
                                                },
                                      'Name' => 'struct pldm_msg',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3359' => {
                                      'BaseType' => '3319',
                                      'Name' => 'struct pldm_msg const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '3364' => {
                                      'BaseType' => '121',
                                      'Name' => 'uint8_t[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '3380' => {
                                      'Header' => 'base.h',
                                      'Line' => '197',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'msg_type',
                                                           'offset' => '0',
                                                           'type' => '3191'
                                                         },
                                                  '1' => {
                                                           'name' => 'instance',
                                                           'offset' => '4',
                                                           'type' => '121'
                                                         },
                                                  '2' => {
                                                           'name' => 'pldm_type',
                                                           'offset' => '5',
                                                           'type' => '121'
                                                         },
                                                  '3' => {
                                                           'name' => 'command',
                                                           'offset' => '6',
                                                           'type' => '121'
                                                         },
                                                  '4' => {
                                                           'name' => 'completion_code',
                                                           'offset' => '7',
                                                           'type' => '121'
                                                         }
                                                },
                                      'Name' => 'struct pldm_header_info',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '3459' => {
                                      'BaseType' => '3380',
                                      'Name' => 'struct pldm_header_info const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '3889' => {
                                      'BaseType' => '2593',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4120' => {
                                      'BaseType' => '3319',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4567' => {
                                      'BaseType' => '3359',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4572' => {
                                      'BaseType' => '121',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4577' => {
                                      'BaseType' => '1023',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5470' => {
                                      'BaseType' => '1093',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6393' => {
                                      'BaseType' => '2776',
                                      'Name' => 'bitfield8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6855' => {
                                      'BaseType' => '2788',
                                      'Name' => 'bitfield8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7643' => {
                                      'BaseType' => '3314',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7882' => {
                                      'BaseType' => '3380',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8142' => {
                                      'BaseType' => '3459',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8147' => {
                                      'BaseType' => '3203',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '10017' => {
                                       'Header' => 'utils.h',
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ptr',
                                                            'offset' => '0',
                                                            'type' => '1219'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '1145'
                                                          }
                                                 },
                                       'Name' => 'struct variable_field',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10413' => {
                                       'BaseType' => '10017',
                                       'Name' => 'struct variable_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12495' => {
                                       'BaseType' => '1011',
                                       'Name' => 'uint16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13058' => {
                                       'BaseType' => '1145',
                                       'Name' => 'size_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15734' => {
                                       'BaseType' => '67',
                                       'Header' => 'types.h',
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '15811' => {
                                       'BaseType' => '1011',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '15828' => {
                                       'BaseType' => '15734',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '15974' => {
                                       'Header' => 'bios.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16008' => {
                                       'Header' => 'bios.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '1011'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '16065'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '16060' => {
                                       'BaseType' => '16008',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '16065' => {
                                       'BaseType' => '114',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '16081' => {
                                       'Header' => 'bios.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '3364'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '16146' => {
                                       'BaseType' => '16081',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '16151' => {
                                       'Header' => 'bios.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '3364'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '16203' => {
                                       'BaseType' => '16151',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '16272' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '206',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '805'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '121'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '16375'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '121'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '1219'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '16363' => {
                                       'BaseType' => '16272',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '16375' => {
                                       'BaseType' => '15811',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16385' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '294',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '805'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '121'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '1011'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '1011'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '1011'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '3889'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '16497' => {
                                       'BaseType' => '16385',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '16507' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '384',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '805'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '15828'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '15828'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '1023'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '15828'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '16605' => {
                                       'BaseType' => '16507',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '16888' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2341'
                                                           }
                                                  },
                                       'Return' => '1207',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '16958' => {
                                       'Line' => '938',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '1219'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '1145'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '1145'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '16888'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'bios_table.c',
                                       'Type' => 'Struct'
                                     },
                          '17028' => {
                                       'BaseType' => '16958',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '18098' => {
                                       'BaseType' => '16958',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18103' => {
                                       'BaseType' => '16203',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18517' => {
                                       'BaseType' => '16146',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19121' => {
                                       'BaseType' => '16060',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20284' => {
                                       'BaseType' => '17028',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24557' => {
                                       'BaseType' => '15828',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24834' => {
                                       'BaseType' => '16605',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25143' => {
                                       'BaseType' => '3889',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '26315' => {
                                       'BaseType' => '16497',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '27815' => {
                                       'BaseType' => '16363',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '29980' => {
                                       'BaseType' => '1023',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '30021' => {
                                       'BaseType' => '121',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '32',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '30033' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '36',
                                       'Name' => 'anon-struct-pldm_types.h-36',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '30297' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '30033'
                                                          }
                                                 },
                                       'Name' => 'union bitfield16_t',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '30309' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '58',
                                       'Name' => 'anon-struct-pldm_types.h-58',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '30797' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '1023'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '30309'
                                                          }
                                                 },
                                       'Name' => 'union bitfield32_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '30809' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '96',
                                       'Name' => 'anon-struct-pldm_types.h-96',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '31745' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '15828'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '30809'
                                                          }
                                                 },
                                       'Name' => 'union bitfield64_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '31804' => {
                                       'BaseType' => '1145',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '33559' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '372',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '33663'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '33679'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '1011'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '121'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '33663' => {
                                       'BaseType' => '121',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '33679' => {
                                       'BaseType' => '121',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '33695' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '386',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '30797'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '121'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '121'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '1011'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '33890' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '420',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '1011'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '1023'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '30297'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '30297'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '1023'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '1023'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '121'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '34072' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '446',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '30797'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '121'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '121'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '121'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '34254' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '474',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '1011'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '121'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '1023'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '121'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '121'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '34436'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '1023'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '121'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '121'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '34436'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '30297'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '30797'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '34436' => {
                                       'BaseType' => '121',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '35374' => {
                                       'BaseType' => '10017',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '35712' => {
                                       'BaseType' => '30021',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '35717' => {
                                       'BaseType' => '31745',
                                       'Name' => 'bitfield64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36474' => {
                                       'BaseType' => '30797',
                                       'Name' => 'bitfield32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37326' => {
                                       'BaseType' => '30297',
                                       'Name' => 'bitfield16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '38884' => {
                                       'BaseType' => '35374',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45180' => {
                                       'BaseType' => '34254',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45405' => {
                                       'BaseType' => '34072',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45706' => {
                                       'BaseType' => '4572',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46003' => {
                                       'BaseType' => '33890',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46619' => {
                                       'BaseType' => '33695',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46929' => {
                                       'BaseType' => '33559',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47696' => {
                                       'BaseType' => '2579',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55031' => {
                                       'BaseType' => '55048',
                                       'Header' => 'pdr.h',
                                       'Line' => '16',
                                       'Name' => 'pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '55043' => {
                                       'BaseType' => '55031',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '55048' => {
                                       'Line' => '25',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '1023'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '1023'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '56139'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '56139'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '55114' => {
                                       'BaseType' => '55131',
                                       'Header' => 'pdr.h',
                                       'Line' => '21',
                                       'Name' => 'pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '55126' => {
                                       'BaseType' => '55114',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '55131' => {
                                       'Line' => '16',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '1023'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '1023'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '4572'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '56127'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '805'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '1011'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '55223' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '287',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '1011'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '1011'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '55280' => {
                                       'BaseType' => '55223',
                                       'Header' => 'pdr.h',
                                       'Line' => '291',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '55324' => {
                                       'BaseType' => '55336',
                                       'Header' => 'pdr.h',
                                       'Line' => '301',
                                       'Name' => 'pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '55336' => {
                                       'Line' => '485',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '56144'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '1011'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '55379' => {
                                       'BaseType' => '55396',
                                       'Header' => 'pdr.h',
                                       'Line' => '306',
                                       'Name' => 'pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '55391' => {
                                       'BaseType' => '55379',
                                       'Name' => 'pldm_entity_node const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '55396' => {
                                       'Line' => '490',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '55280'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '55280'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_container_id',
                                                            'offset' => '18',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '56144'
                                                          },
                                                   '4' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '56144'
                                                          },
                                                   '5' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '55667' => {
                                       'Header' => 'platform.h',
                                       'Line' => '481',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '1023'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '121'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '1011'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '1011'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '56127' => {
                                       'BaseType' => '55131',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56139' => {
                                       'BaseType' => '55114',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56144' => {
                                       'BaseType' => '55379',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58051' => {
                                       'BaseType' => '55043',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58056' => {
                                       'BaseType' => '55280',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58066' => {
                                       'BaseType' => '805',
                                       'Name' => '_Bool*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '62861' => {
                                       'BaseType' => '55031',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70716' => {
                                       'BaseType' => '58056',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70780' => {
                                       'BaseType' => '55324',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71227' => {
                                       'BaseType' => '56144',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '77247' => {
                                       'BaseType' => '55391',
                                       'Name' => 'pldm_entity_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78702' => {
                                       'BaseType' => '55126',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83007' => {
                                       'BaseType' => '74',
                                       'Header' => 'types.h',
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '83038' => {
                                       'BaseType' => '93',
                                       'Header' => 'types.h',
                                       'Line' => '39',
                                       'Name' => '__int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '83069' => {
                                       'BaseType' => '100',
                                       'Header' => 'types.h',
                                       'Line' => '41',
                                       'Name' => '__int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '83148' => {
                                       'BaseType' => '83007',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '83160' => {
                                       'BaseType' => '83038',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '25',
                                       'Name' => 'int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '83172' => {
                                       'BaseType' => '83069',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '26',
                                       'Name' => 'int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '83437' => {
                                       'BaseType' => '133',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '164',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '84671' => {
                                       'Header' => 'platform.h',
                                       'Line' => '259',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '84705' => {
                                       'BaseType' => '84671',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '85007' => {
                                       'Header' => 'platform.h',
                                       'Line' => '556',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '55667'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '1011'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '1011'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '1011'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '1011'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '121'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '30021'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '121'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '3364'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '85151' => {
                                       'Header' => 'platform.h',
                                       'Line' => '573',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '85209'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '85204' => {
                                       'BaseType' => '85151',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '85209' => {
                                       'BaseType' => '2776',
                                       'Name' => 'bitfield8_t[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '85225' => {
                                       'Header' => 'platform.h',
                                       'Line' => '583',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '55667'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '1011'
                                                          },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '1011'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '1011'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '1011'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '1011'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '121'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '30021'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '121'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '3364'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '85570' => {
                                       'Header' => 'platform.h',
                                       'Line' => '674',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '83148'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '83160'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '1023'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '83172'
                                                          },
                                                   '6' => {
                                                            'name' => 'value_f32',
                                                            'offset' => '0',
                                                            'type' => '83437'
                                                          }
                                                 },
                                       'Name' => 'union union_range_field_format',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '86133' => {
                                       'Header' => 'platform.h',
                                       'Line' => '731',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '83148'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '83160'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '1023'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '83172'
                                                          }
                                                 },
                                       'Name' => 'union union_sensor_data_size',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '86145' => {
                                       'Header' => 'platform.h',
                                       'Line' => '738',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '1023'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '121'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '1011'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '1011'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '86224' => {
                                       'Header' => 'platform.h',
                                       'Line' => '756',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          }
                                                 },
                                       'Name' => 'anon-union-platform.h-756',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '86258' => {
                                       'Header' => 'platform.h',
                                       'Line' => '751',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '86145'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '1011'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '1011'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '1011'
                                                          },
                                                   '4' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '86224'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '1011'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '121'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '30021'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '121'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '83148'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '121'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '121'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '121'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '83148'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '121'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '121'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '121'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '30021'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '121'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '83437'
                                                           },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '83437'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '1011'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '121'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '121'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '86133'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '2776'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '2776'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '83437'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '83437'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '86133'
                                                           },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '86133'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '121'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '2776'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '85570'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '85570'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '85570'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '85570'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '85570'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '85570'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '85570'
                                                           },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '85570'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '85570'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '86811' => {
                                       'Header' => 'platform.h',
                                       'Line' => '803',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '85209'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '86864' => {
                                       'BaseType' => '86811',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '86869' => {
                                       'Header' => 'platform.h',
                                       'Line' => '851',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '86909' => {
                                       'BaseType' => '86869',
                                       'Header' => 'platform.h',
                                       'Line' => '854',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '86921' => {
                                       'Header' => 'platform.h',
                                       'Line' => '860',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '121'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '86987' => {
                                       'BaseType' => '86921',
                                       'Header' => 'platform.h',
                                       'Line' => '868',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '86999' => {
                                       'Header' => 'platform.h',
                                       'Line' => '874',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'effecter_op_state',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'pending_state',
                                                            'offset' => '1',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'present_state',
                                                            'offset' => '2',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_effecter_states',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '87052' => {
                                       'BaseType' => '86999',
                                       'Header' => 'platform.h',
                                       'Line' => '878',
                                       'Name' => 'get_effecter_state_field',
                                       'Size' => '3',
                                       'Type' => 'Typedef'
                                     },
                          '87733' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1023',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_effecter_count',
                                                            'offset' => '1',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'field',
                                                            'offset' => '2',
                                                            'type' => '87786'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_state_effecter_states_resp',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '87786' => {
                                       'BaseType' => '87052',
                                       'Name' => 'get_effecter_state_field[8]',
                                       'Size' => '24',
                                       'Type' => 'Array'
                                     },
                          '87802' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1033',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '1011'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '3364'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '88014' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1114',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '3364'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '90097' => {
                                       'BaseType' => '87733',
                                       'Name' => 'struct pldm_get_state_effecter_states_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '146615' => {
                                        'BaseType' => '13058',
                                        'Name' => 'size_t*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '150225' => {
                                        'BaseType' => '150235',
                                        'Name' => 'uint32_t const*const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '150230' => {
                                        'BaseType' => '29980',
                                        'Name' => 'uint32_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '150235' => {
                                        'BaseType' => '150230',
                                        'Name' => 'uint32_t const*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '150240' => {
                                        'BaseType' => '88014',
                                        'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '214742' => {
                                        'BaseType' => '86258',
                                        'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '230136' => {
                                        'BaseType' => '87802',
                                        'Name' => 'struct pldm_sensor_event_data*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '230141' => {
                                        'BaseType' => '230136',
                                        'Name' => 'struct pldm_sensor_event_data*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '233075' => {
                                        'BaseType' => '86987',
                                        'Name' => 'get_sensor_state_field*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '246335' => {
                                        'BaseType' => '86909',
                                        'Name' => 'set_effecter_state_field*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '247301' => {
                                        'BaseType' => '85007',
                                        'Name' => 'struct pldm_state_sensor_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '247306' => {
                                        'BaseType' => '247301',
                                        'Name' => 'struct pldm_state_sensor_pdr*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '247311' => {
                                        'BaseType' => '85204',
                                        'Name' => 'struct state_sensor_possible_states const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '247316' => {
                                        'BaseType' => '247311',
                                        'Name' => 'struct state_sensor_possible_states const*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '247705' => {
                                        'BaseType' => '85225',
                                        'Name' => 'struct pldm_state_effecter_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '247710' => {
                                        'BaseType' => '247705',
                                        'Name' => 'struct pldm_state_effecter_pdr*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '247715' => {
                                        'BaseType' => '86864',
                                        'Name' => 'struct state_effecter_possible_states const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '247720' => {
                                        'BaseType' => '247715',
                                        'Name' => 'struct state_effecter_possible_states const*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '253400' => {
                                        'Line' => '20',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'prev',
                                                             'offset' => '0',
                                                             'type' => '187'
                                                           },
                                                    '1' => {
                                                             'name' => 'allocations',
                                                             'offset' => '4',
                                                             'type' => '1023'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_tid_state',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Source' => 'instance-id.c',
                                        'Type' => 'Struct'
                                      },
                          '253439' => {
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'state',
                                                             'offset' => '0',
                                                             'type' => '253481'
                                                           },
                                                    '1' => {
                                                             'name' => 'lock_db_fd',
                                                             'offset' => '8264',
                                                             'type' => '100'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_instance_db',
                                        'PrivateABI' => 1,
                                        'Size' => '2052',
                                        'Source' => 'instance-id.c',
                                        'Type' => 'Struct'
                                      },
                          '253481' => {
                                        'BaseType' => '253400',
                                        'Name' => 'struct pldm_tid_state[256]',
                                        'Size' => '2048',
                                        'Type' => 'Array'
                                      },
                          '253951' => {
                                        'BaseType' => '253439',
                                        'Name' => 'struct pldm_instance_db*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '254376' => {
                                        'BaseType' => '187',
                                        'Name' => 'pldm_instance_id_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '254552' => {
                                        'BaseType' => '253951',
                                        'Name' => 'struct pldm_instance_db**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '255309' => {
                                        'BaseType' => '121',
                                        'Header' => 'pldm.h',
                                        'Line' => '13',
                                        'Name' => 'mctp_eid_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '255424' => {
                                        'BaseType' => '284',
                                        'Header' => 'pldm.h',
                                        'Line' => '30',
                                        'Name' => 'pldm_requester_rc_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '255442' => {
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '255515'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '100'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '259147'
                                                           },
                                                    '3' => {
                                                             'name' => 'socket_send_buf',
                                                             'offset' => '768',
                                                             'type' => '258096'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_mctp_demux',
                                        'PrivateABI' => 1,
                                        'Size' => '312',
                                        'Source' => 'mctp-demux.c',
                                        'Type' => 'Struct'
                                      },
                          '255468' => {
                                        'BaseType' => '255442',
                                        'Name' => 'struct pldm_transport_mctp_demux*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '255510' => {
                                        'BaseType' => '255515',
                                        'Name' => 'struct pldm_transport*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '255515' => {
                                        'Header' => 'transport.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '3889'
                                                           },
                                                    '1' => {
                                                             'name' => 'version',
                                                             'offset' => '8',
                                                             'type' => '121'
                                                           },
                                                    '2' => {
                                                             'name' => 'recv',
                                                             'offset' => '22',
                                                             'type' => '258407'
                                                           },
                                                    '3' => {
                                                             'name' => 'send',
                                                             'offset' => '36',
                                                             'type' => '258448'
                                                           },
                                                    '4' => {
                                                             'name' => 'init_pollfd',
                                                             'offset' => '50',
                                                             'type' => '258528'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '255651' => {
                                        'BaseType' => '175',
                                        'Name' => 'pldm_tid_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '255754' => {
                                        'BaseType' => '255468',
                                        'Name' => 'struct pldm_transport_mctp_demux**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '257816' => {
                                        'BaseType' => '46',
                                        'Header' => 'int-ll64.h',
                                        'Line' => '21',
                                        'Name' => '__u8',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '257828' => {
                                        'BaseType' => '53',
                                        'Header' => 'int-ll64.h',
                                        'Line' => '24',
                                        'Name' => '__u16',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '258096' => {
                                        'Header' => 'socket.h',
                                        'Line' => '5',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'size',
                                                             'offset' => '0',
                                                             'type' => '100'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '4',
                                                             'type' => '100'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '100'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_socket_sndbuf',
                                        'PrivateABI' => 1,
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '258407' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '255510'
                                                            },
                                                     '1' => {
                                                              'type' => '255651'
                                                            },
                                                     '2' => {
                                                              'type' => '47696'
                                                            },
                                                     '3' => {
                                                              'type' => '13058'
                                                            }
                                                   },
                                        'Return' => '255424',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '258448' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '255510'
                                                            },
                                                     '1' => {
                                                              'type' => '175'
                                                            },
                                                     '2' => {
                                                              'type' => '2341'
                                                            },
                                                     '3' => {
                                                              'type' => '1145'
                                                            }
                                                   },
                                        'Return' => '255424',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '258473' => {
                                        'BaseType' => '258478',
                                        'Name' => 'struct pollfd*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '258478' => {
                                        'Header' => 'poll.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'fd',
                                                             'offset' => '0',
                                                             'type' => '100'
                                                           },
                                                    '1' => {
                                                             'name' => 'events',
                                                             'offset' => '4',
                                                             'type' => '93'
                                                           },
                                                    '2' => {
                                                             'name' => 'revents',
                                                             'offset' => '6',
                                                             'type' => '93'
                                                           }
                                                  },
                                        'Name' => 'struct pollfd',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '258528' => {
                                        'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '255510'
                                                            },
                                                     '1' => {
                                                              'type' => '258473'
                                                            }
                                                   },
                                        'Return' => '100',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '258533' => {
                                        'BaseType' => '53',
                                        'Header' => 'socket.h',
                                        'Line' => '10',
                                        'Name' => '__kernel_sa_family_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '258881' => {
                                        'Header' => 'mctp.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 's_addr',
                                                             'offset' => '0',
                                                             'type' => '255309'
                                                           }
                                                  },
                                        'Name' => 'struct mctp_addr',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '258907' => {
                                        'Header' => 'mctp.h',
                                        'Line' => '22',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'smctp_family',
                                                             'offset' => '0',
                                                             'type' => '258533'
                                                           },
                                                    '1' => {
                                                             'name' => '__smctp_pad0',
                                                             'offset' => '2',
                                                             'type' => '257828'
                                                           },
                                                    '2' => {
                                                             'name' => 'smctp_network',
                                                             'offset' => '4',
                                                             'type' => '60'
                                                           },
                                                    '3' => {
                                                             'name' => 'smctp_addr',
                                                             'offset' => '8',
                                                             'type' => '258881'
                                                           },
                                                    '4' => {
                                                             'name' => 'smctp_type',
                                                             'offset' => '9',
                                                             'type' => '257816'
                                                           },
                                                    '5' => {
                                                             'name' => 'smctp_tag',
                                                             'offset' => '16',
                                                             'type' => '257816'
                                                           },
                                                    '6' => {
                                                             'name' => '__smctp_pad1',
                                                             'offset' => '17',
                                                             'type' => '257816'
                                                           }
                                                  },
                                        'Name' => 'struct sockaddr_mctp',
                                        'PrivateABI' => 1,
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '259011' => {
                                        'BaseType' => '258907',
                                        'Name' => 'struct sockaddr_mctp const',
                                        'Size' => '12',
                                        'Type' => 'Const'
                                      },
                          '259054' => {
                                        'Line' => '34',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '255515'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '100'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '259147'
                                                           },
                                                    '3' => {
                                                             'name' => 'socket_send_buf',
                                                             'offset' => '768',
                                                             'type' => '258096'
                                                           },
                                                    '4' => {
                                                             'name' => 'bound',
                                                             'offset' => '786',
                                                             'type' => '805'
                                                           },
                                                    '5' => {
                                                             'name' => 'cookie_jar',
                                                             'offset' => '800',
                                                             'type' => '199'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_af_mctp',
                                        'PrivateABI' => 1,
                                        'Size' => '336',
                                        'Source' => 'af-mctp.c',
                                        'Type' => 'Struct'
                                      },
                          '259147' => {
                                        'BaseType' => '175',
                                        'Name' => 'pldm_tid_t[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '259963' => {
                                        'BaseType' => '259054',
                                        'Name' => 'struct pldm_transport_af_mctp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '259968' => {
                                        'BaseType' => '259011',
                                        'Name' => 'struct sockaddr_mctp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '260281' => {
                                        'BaseType' => '259963',
                                        'Name' => 'struct pldm_transport_af_mctp**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.8.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.2.5' => 0,
                                                          '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                          '__errno_location@GLIBC_2.2.5' => 0,
                                                          '__gmon_start__' => 0,
                                                          '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                          '__recv_chk@GLIBC_2.4' => 0,
                                                          '__recvfrom_chk@GLIBC_2.4' => 0,
                                                          '__stack_chk_fail@GLIBC_2.4' => 0,
                                                          'bind@GLIBC_2.2.5' => 0,
                                                          'calloc@GLIBC_2.2.5' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.2.5' => 0,
                                                          'connect@GLIBC_2.2.5' => 0,
                                                          'dup@GLIBC_2.2.5' => 0,
                                                          'fclose@GLIBC_2.2.5' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'fgets@GLIBC_2.2.5' => 0,
                                                          'fopen64@GLIBC_2.2.5' => 0,
                                                          'free@GLIBC_2.2.5' => 0,
                                                          'getsockopt@GLIBC_2.2.5' => 0,
                                                          'malloc@GLIBC_2.2.5' => 0,
                                                          'memcmp@GLIBC_2.2.5' => 0,
                                                          'memcpy@GLIBC_2.14' => 0,
                                                          'open64@GLIBC_2.2.5' => 0,
                                                          'poll@GLIBC_2.2.5' => 0,
                                                          'ppoll@GLIBC_2.4' => 0,
                                                          'recv@GLIBC_2.2.5' => 0,
                                                          'recvmsg@GLIBC_2.2.5' => 0,
                                                          'sendmsg@GLIBC_2.2.5' => 0,
                                                          'sendto@GLIBC_2.2.5' => 0,
                                                          'setsockopt@GLIBC_2.2.5' => 0,
                                                          'socket@GLIBC_2.2.5' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.2.5' => 0,
                                                          'strtol@GLIBC_2.2.5' => 0,
                                                          'timerfd_create@GLIBC_2.8' => 0,
                                                          'timerfd_settime@GLIBC_2.8' => 0,
                                                          'write@GLIBC_2.2.5' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
