$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'AARCH64',
          'GccVersion' => '13.1.1',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'file_io.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'pdr_oem_ibm.h' => 1,
                         'platform.h' => 1,
                         'platform_oem_ibm.h' => 1,
                         'pldm.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.2.0',
          'LibraryVersion' => '0.2.0',
          'NameSpaces' => {},
          'Needed' => {
                        'ld-linux-aarch64.so.1' => 1,
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {},
          'SymbolInfo' => {
                            '100033' => {
                                          'Header' => 'pdr.h',
                                          'Param' => {

                                                 'pldm_pdr_fru_record_set_find_by_rsi' => 1,
                                                 'pldm_pdr_get_next_record' => 1,
                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'pldm_transport_af_mctp_core' => 1,
                                                 'pldm_transport_af_mctp_destroy' => 1,
                                                 'pldm_transport_af_mctp_init' => 1,
                                                 'pldm_transport_af_mctp_init_pollfd' => 1,
                                                 'pldm_transport_af_mctp_map_tid' => 1,
                                                 'pldm_transport_af_mctp_unmap_tid' => 1,
                                                 'pldm_transport_mctp_demux_core' => 1,
                                                 'pldm_transport_mctp_demux_destroy' => 1,
                                                 'pldm_transport_mctp_demux_get_socket_fd' => 1,
                                                 'pldm_transport_mctp_demux_init' => 1,
                                                 'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                 'pldm_transport_mctp_demux_init_with_fd' => 1,
                                                 'pldm_transport_mctp_demux_map_tid' => 1,
                                                 'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                 'pldm_transport_poll' => 1,
                                                 'pldm_transport_recv_msg' => 1,
                                                 'pldm_transport_send_msg' => 1,
                                                 'pldm_transport_send_recv_msg' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '102' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '105131' => {
                                        'BaseType' => '168',
                                        'Header' => 'base.h',
                                        'Line' => '14',
                                        'Name' => 'pldm_tid_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '105143' => {
                                        'BaseType' => '168',
                                        'Header' => 'instance-id.h',
                                        'Line' => '11',
                                        'Name' => 'pldm_instance_id_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '105520' => {
                                        'Header' => undef,
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'prev',
                                                             'offset' => '0',
                                                             'type' => '105143'
                                                           },
                                                    '1' => {
                                                             'name' => 'allocations',
                                                             'offset' => '4',
                                                             'type' => '180'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_tid_state',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '105559' => {
                                        'Header' => undef,
                                        'Line' => '23',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'state',
                                                             'offset' => '0',
                                                             'type' => '105601'
                                                           },
                                                    '1' => {
                                                             'name' => 'lock_db_fd',
                                                             'offset' => '8264',
                                                             'type' => '74'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_instance_db',
                                        'PrivateABI' => 1,
                                        'Size' => '2052',
                                        'Type' => 'Struct'
                                      },
                          '105601' => {
                                        'BaseType' => '105520',
                                        'Name' => 'struct pldm_tid_state[256]',
                                        'Size' => '2048',
                                        'Type' => 'Array'
                                      },
                          '106014' => {
                                        'BaseType' => '105559',
                                        'Name' => 'struct pldm_instance_db*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '106420' => {
                                        'BaseType' => '105143',
                                        'Name' => 'pldm_instance_id_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '106596' => {
                                        'BaseType' => '106014',
                                        'Name' => 'struct pldm_instance_db**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '107082' => {
                                        'BaseType' => '168',
                                        'Header' => 'pldm.h',
                                        'Line' => '12',
                                        'Name' => 'mctp_eid_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '107094' => {
                                        'Header' => 'pldm.h',
                                        'Line' => '14',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_REQUESTER_SUCCESS',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                             'value' => '18446744073709551615 (-1)'
                                                           },
                                                    '10' => {
                                                              'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                              'value' => '18446744073709551606 (-10)'
                                                            },
                                                    '11' => {
                                                              'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                              'value' => '18446744073709551605 (-11)'
                                                            },
                                                    '12' => {
                                                              'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                              'value' => '18446744073709551604 (-12)'
                                                            },
                                                    '2' => {
                                                             'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                             'value' => '18446744073709551614 (-2)'
                                                           },
                                                    '3' => {
                                                             'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                             'value' => '18446744073709551613 (-3)'
                                                           },
                                                    '4' => {
                                                             'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                             'value' => '18446744073709551612 (-4)'
                                                           },
                                                    '5' => {
                                                             'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                             'value' => '18446744073709551611 (-5)'
                                                           },
                                                    '6' => {
                                                             'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                             'value' => '18446744073709551610 (-6)'
                                                           },
                                                    '7' => {
                                                             'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                             'value' => '18446744073709551609 (-7)'
                                                           },
                                                    '8' => {
                                                             'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                             'value' => '18446744073709551608 (-8)'
                                                           },
                                                    '9' => {
                                                             'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                             'value' => '18446744073709551607 (-9)'
                                                           }
                                                  },
                                        'Name' => 'enum pldm_requester_error_codes',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '107191' => {
                                        'BaseType' => '107094',
                                        'Header' => 'pldm.h',
                                        'Line' => '28',
                                        'Name' => 'pldm_requester_rc_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '107334' => {
                                        'Header' => undef,
                                        'Line' => '22',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '107407'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '74'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '110614'
                                                           },
                                                    '3' => {
                                                             'name' => 'socket_send_buf',
                                                             'offset' => '768',
                                                             'type' => '109761'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_mctp_demux',
                                        'PrivateABI' => 1,
                                        'Size' => '312',
                                        'Type' => 'Struct'
                                      },
                          '107360' => {
                                        'BaseType' => '107334',
                                        'Name' => 'struct pldm_transport_mctp_demux*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '107402' => {
                                        'BaseType' => '107407',
                                        'Name' => 'struct pldm_transport*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '107407' => {
                                        'Header' => undef,
                                        'Line' => '21',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '12199'
                                                           },
                                                    '1' => {
                                                             'name' => 'version',
                                                             'offset' => '8',
                                                             'type' => '168'
                                                           },
                                                    '2' => {
                                                             'name' => 'recv',
                                                             'offset' => '22',
                                                             'type' => '109941'
                                                           },
                                                    '3' => {
                                                             'name' => 'send',
                                                             'offset' => '36',
                                                             'type' => '109982'
                                                           },
                                                    '4' => {
                                                             'name' => 'init_pollfd',
                                                             'offset' => '50',
                                                             'type' => '110063'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '107641' => {
                                        'BaseType' => '107360',
                                        'Name' => 'struct pldm_transport_mctp_demux**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '109' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '109761' => {
                                        'Header' => undef,
                                        'Line' => '4',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'size',
                                                             'offset' => '0',
                                                             'type' => '74'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '4',
                                                             'type' => '74'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '74'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_socket_sndbuf',
                                        'PrivateABI' => 1,
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '109941' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void**, size_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '107402'
                                                            },
                                                     '1' => {
                                                              'type' => '105131'
                                                            },
                                                     '2' => {
                                                              'type' => '16592'
                                                            },
                                                     '3' => {
                                                              'type' => '8822'
                                                            }
                                                   },
                                        'Return' => '107191',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '109982' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '107402'
                                                            },
                                                     '1' => {
                                                              'type' => '105131'
                                                            },
                                                     '2' => {
                                                              'type' => '1434'
                                                            },
                                                     '3' => {
                                                              'type' => '123'
                                                            }
                                                   },
                                        'Return' => '107191',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '110007' => {
                                        'BaseType' => '110012',
                                        'Name' => 'struct pollfd*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110012' => {
                                        'Header' => undef,
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'fd',
                                                             'offset' => '0',
                                                             'type' => '74'
                                                           },
                                                    '1' => {
                                                             'name' => 'events',
                                                             'offset' => '4',
                                                             'type' => '60'
                                                           },
                                                    '2' => {
                                                             'name' => 'revents',
                                                             'offset' => '6',
                                                             'type' => '60'
                                                           }
                                                  },
                                        'Name' => 'struct pollfd',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '110063' => {
                                        'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '107402'
                                                            },
                                                     '1' => {
                                                              'type' => '110007'
                                                            }
                                                   },
                                        'Return' => '74',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '110546' => {
                                        'Header' => undef,
                                        'Line' => '21',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '107407'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '74'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '110614'
                                                           },
                                                    '3' => {
                                                             'name' => 'socket_send_buf',
                                                             'offset' => '768',
                                                             'type' => '109761'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_af_mctp',
                                        'PrivateABI' => 1,
                                        'Size' => '312',
                                        'Type' => 'Struct'
                                      },
                          '110614' => {
                                        'BaseType' => '105131',
                                        'Name' => 'pldm_tid_t[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '110986' => {
                                        'BaseType' => '110546',
                                        'Name' => 'struct pldm_transport_af_mctp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111214' => {
                                        'BaseType' => '110986',
                                        'Name' => 'struct pldm_transport_af_mctp**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11261' => {
                                       'BaseType' => '116',
                                       'Name' => 'char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11278' => {
                                       'BaseType' => '116',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '11295' => {
                                       'BaseType' => '123',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '11307' => {
                                       'BaseType' => '46',
                                       'Header' => undef,
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11381' => {
                                       'BaseType' => '109',
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11393' => {
                                       'BaseType' => '11307',
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11458' => {
                                       'BaseType' => '4895',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '11475' => {
                                       'BaseType' => '180',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '116' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '11646' => {
                                       'BaseType' => '168',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '31',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11658' => {
                                       'BaseType' => '446',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '163',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12199' => {
                                       'BaseType' => '11278',
                                       'Name' => 'char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12204' => {
                                       'BaseType' => '11381',
                                       'Header' => undef,
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '123' => {
                                     'BaseType' => '102',
                                     'Header' => undef,
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '12747' => {
                                       'Header' => 'platform.h',
                                       'Line' => '243',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12781' => {
                                       'BaseType' => '12747',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13004' => {
                                       'Header' => 'platform.h',
                                       'Line' => '461',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '13083' => {
                                       'Header' => 'platform.h',
                                       'Line' => '533',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13004'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '4895'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '4895'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '4895'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '168'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '11646'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '13227' => {
                                       'Header' => 'platform.h',
                                       'Line' => '550',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13285'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '13280' => {
                                       'BaseType' => '13227',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13301' => {
                                       'Header' => 'platform.h',
                                       'Line' => '560',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13004'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '4895'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '874'
                                                           },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '4895'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '4895'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '4895'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '11646'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '13654' => {
                                       'Header' => 'platform.h',
                                       'Line' => '715',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '13733' => {
                                       'Header' => 'platform.h',
                                       'Line' => '728',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13654'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '4895'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '168'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '168'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '168'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '11393'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '168'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '168'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '168'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '11646'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '168'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '11658'
                                                           },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '4895'
                                                          },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '11658'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '4895'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '168'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '168'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '13642'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '11634'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '11634'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '11658'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '11658'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '13642'
                                                           },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '4895'
                                                          },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '13642'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '168'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '11634'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '13550'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '13550'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '13550'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '13550'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '13550'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '13550'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '13550'
                                                           },
                                                   '4' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '24',
                                                            'type' => '4895'
                                                          },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '13550'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '13550'
                                                           },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '4895'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '11646'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '11393'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '142' => {
                                     'BaseType' => '53',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '14293' => {
                                       'Header' => 'platform.h',
                                       'Line' => '777',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13285'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '1434' => {
                                      'BaseType' => '1439',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '14346' => {
                                       'BaseType' => '14293',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14351' => {
                                       'Header' => 'platform.h',
                                       'Line' => '825',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '1439' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '14391' => {
                                       'BaseType' => '14351',
                                       'Header' => 'platform.h',
                                       'Line' => '828',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '14403' => {
                                       'Header' => 'platform.h',
                                       'Line' => '834',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14469' => {
                                       'BaseType' => '14403',
                                       'Header' => 'platform.h',
                                       'Line' => '842',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '14668' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '15150' => {
                                       'Header' => 'platform.h',
                                       'Line' => '979',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15362' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1060',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '154' => {
                                     'BaseType' => '81',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1615' => {
                                      'BaseType' => '830',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '16592' => {
                                       'BaseType' => '166',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '166' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '168' => {
                                     'BaseType' => '142',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '180' => {
                                     'BaseType' => '154',
                                     'Header' => undef,
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2029' => {
                                      'BaseType' => '869',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2034' => {
                                      'BaseType' => '168',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2039' => {
                                      'BaseType' => '180',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '20616' => {
                                       'BaseType' => '8822',
                                       'Name' => 'size_t*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '22159' => {
                                       'BaseType' => '22169',
                                       'Name' => 'uint32_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22164' => {
                                       'BaseType' => '11475',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22169' => {
                                       'BaseType' => '22164',
                                       'Name' => 'uint32_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '22174' => {
                                       'BaseType' => '15362',
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2811' => {
                                      'BaseType' => '429',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '28498' => {
                                       'BaseType' => '13733',
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3250' => {
                                      'BaseType' => '441',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '34808' => {
                                       'BaseType' => '15150',
                                       'Name' => 'struct pldm_sensor_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34813' => {
                                       'BaseType' => '34808',
                                       'Name' => 'struct pldm_sensor_event_data*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '35778' => {
                                       'BaseType' => '14469',
                                       'Name' => 'get_sensor_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '363' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '24',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'major',
                                                          'offset' => '0',
                                                          'type' => '168'
                                                        },
                                                 '1' => {
                                                          'name' => 'minor',
                                                          'offset' => '1',
                                                          'type' => '168'
                                                        },
                                                 '2' => {
                                                          'name' => 'update',
                                                          'offset' => '2',
                                                          'type' => '168'
                                                        },
                                                 '3' => {
                                                          'name' => 'alpha',
                                                          'offset' => '3',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '40816' => {
                                       'BaseType' => '14391',
                                       'Name' => 'set_effecter_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41616' => {
                                       'BaseType' => '13083',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41621' => {
                                       'BaseType' => '41616',
                                       'Name' => 'struct pldm_state_sensor_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '41626' => {
                                       'BaseType' => '13280',
                                       'Name' => 'struct state_sensor_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41631' => {
                                       'BaseType' => '41626',
                                       'Name' => 'struct state_sensor_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '41948' => {
                                       'BaseType' => '13301',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41953' => {
                                       'BaseType' => '41948',
                                       'Name' => 'struct pldm_state_effecter_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '41958' => {
                                       'BaseType' => '14346',
                                       'Name' => 'struct state_effecter_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41963' => {
                                       'BaseType' => '41958',
                                       'Name' => 'struct state_effecter_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '429' => {
                                     'BaseType' => '363',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '29',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '441' => {
                                     'BaseType' => '429',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '446' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '45473' => {
                                       'BaseType' => '102',
                                       'Header' => undef,
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '45550' => {
                                       'BaseType' => '45473',
                                       'Header' => undef,
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '45562' => {
                                       'Header' => 'bios.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '4558' => {
                                      'BaseType' => '825',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '45596' => {
                                       'Header' => 'bios.h',
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '4895'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '45653'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '4563' => {
                                      'BaseType' => '890',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '45648' => {
                                       'BaseType' => '45596',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '45653' => {
                                       'BaseType' => '116',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '45669' => {
                                       'Header' => 'bios.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '45734' => {
                                       'BaseType' => '45669',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '45755' => {
                                       'Header' => 'bios.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '45807' => {
                                       'BaseType' => '45755',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '45876' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '224',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6265'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '45979'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '6087'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '45967' => {
                                       'BaseType' => '45876',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '45979' => {
                                       'BaseType' => '11458',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45989' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '347',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6265'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '4895'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '4895'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '12199'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '46' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '46101' => {
                                       'BaseType' => '45989',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '46111' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '454',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6265'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '45550'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '45550'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '180'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '45550'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '46209' => {
                                       'BaseType' => '46111',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '4653' => {
                                      'BaseType' => '969',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '46553' => {
                                       'Name' => 'size_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1434'
                                                           }
                                                  },
                                       'Return' => '123',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '4658' => {
                                      'BaseType' => '714',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '46621' => {
                                       'Header' => undef,
                                       'Line' => '959',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '6087'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '123'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '123'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '46553'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '46691' => {
                                       'BaseType' => '46621',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '47721' => {
                                       'BaseType' => '46621',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47726' => {
                                       'BaseType' => '45807',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '48141' => {
                                       'BaseType' => '45734',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4838' => {
                                      'BaseType' => '67',
                                      'Header' => undef,
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '48730' => {
                                       'BaseType' => '45648',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4890' => {
                                      'BaseType' => '168',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '4895' => {
                                      'BaseType' => '4838',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '49863' => {
                                       'BaseType' => '46691',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '54689' => {
                                       'BaseType' => '45550',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54893' => {
                                       'BaseType' => '46209',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55155' => {
                                       'BaseType' => '12199',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56406' => {
                                       'BaseType' => '46101',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58272' => {
                                       'BaseType' => '45967',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '6048' => {
                                      'Header' => 'utils.h',
                                      'Line' => '18',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '6087'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '123'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6087' => {
                                      'BaseType' => '4890',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6265' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '64114' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '329',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '64218'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '14668'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '4895'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '64218' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '64250' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '343',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '61617'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '168'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '64445' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '377',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '4895'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '61119'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '61119'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '180'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '180'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '168'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '64627' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '403',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '61617'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '168'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '64731' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '417',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '4895'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '64913'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '61119'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '61617'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '180'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '64913'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '180'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '6481' => {
                                      'BaseType' => '6048',
                                      'Name' => 'struct variable_field*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '64913' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '65773' => {
                                       'BaseType' => '6048',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '66118' => {
                                       'BaseType' => '11646',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '69128' => {
                                       'BaseType' => '65773',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70409' => {
                                       'BaseType' => '64731',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70639' => {
                                       'BaseType' => '64627',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70937' => {
                                       'BaseType' => '2034',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71231' => {
                                       'BaseType' => '64445',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '714' => {
                                     'Header' => 'base.h',
                                     'Line' => '117',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '71854' => {
                                       'BaseType' => '64250',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72006' => {
                                       'BaseType' => '64114',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '78521' => {
                                       'Header' => 'pdr_data.h',
                                       'Line' => '12',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '2034'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '78610'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '6265'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '78610' => {
                                       'BaseType' => '78521',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78622' => {
                                       'BaseType' => '78521',
                                       'Header' => 'pdr_data.h',
                                       'Line' => '19',
                                       'Name' => 'pldm_pdr_record',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '78634' => {
                                       'BaseType' => '78622',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '78639' => {
                                       'Header' => 'pdr_data.h',
                                       'Line' => '21',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '78699'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '78699'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '78699' => {
                                       'BaseType' => '78622',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78704' => {
                                       'BaseType' => '78639',
                                       'Header' => 'pdr_data.h',
                                       'Line' => '26',
                                       'Name' => 'pldm_pdr',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '78716' => {
                                       'BaseType' => '78704',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '78721' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '354',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '4895'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '78778' => {
                                       'BaseType' => '78721',
                                       'Header' => 'pdr.h',
                                       'Line' => '358',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '78820' => {
                                       'BaseType' => '78833',
                                       'Header' => undef,
                                       'Line' => '368',
                                       'Name' => 'pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '78833' => {
                                       'Header' => undef,
                                       'Line' => '908',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '80852'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '78876' => {
                                       'BaseType' => '78894',
                                       'Header' => undef,
                                       'Line' => '373',
                                       'Name' => 'pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '78889' => {
                                       'BaseType' => '78876',
                                       'Name' => 'pldm_entity_node const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '78894' => {
                                       'Header' => undef,
                                       'Line' => '913',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '78778'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '78778'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_container_id',
                                                            'offset' => '18',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '80852'
                                                          },
                                                   '4' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '80852'
                                                          },
                                                   '5' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '80852' => {
                                       'BaseType' => '78876',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80930' => {
                                       'BaseType' => '78716',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '81826' => {
                                       'BaseType' => '81831',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81831' => {
                                       'BaseType' => '78778',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81922' => {
                                       'BaseType' => '78820',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '82301' => {
                                       'BaseType' => '80852',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '825' => {
                                     'BaseType' => '714',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '8294' => {
                                      'BaseType' => '4895',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '830' => {
                                     'Header' => 'base.h',
                                     'Line' => '150',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '714'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '874'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '83649' => {
                                       'BaseType' => '78704',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '869' => {
                                     'BaseType' => '830',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '874' => {
                                     'BaseType' => '168',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '8822' => {
                                      'BaseType' => '123',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '890' => {
                                     'Header' => 'base.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '702'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '168'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '168'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '168'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '91913' => {
                                       'BaseType' => '78889',
                                       'Name' => 'pldm_entity_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '95646' => {
                                       'BaseType' => '78634',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '969' => {
                                     'BaseType' => '890',
                                     'Name' => 'struct pldm_header_info const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.2.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.17' => 0,
                                                          '__cxa_finalize@GLIBC_2.17' => 0,
                                                          '__errno_location@GLIBC_2.17' => 0,
                                                          '__gmon_start__' => 0,
                                                          'calloc@GLIBC_2.17' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.17' => 0,
                                                          'connect@GLIBC_2.17' => 0,
                                                          'dup@GLIBC_2.17' => 0,
                                                          'fclose@GLIBC_2.17' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'fgets@GLIBC_2.17' => 0,
                                                          'fopen64@GLIBC_2.17' => 0,
                                                          'free@GLIBC_2.17' => 0,
                                                          'getsockopt@GLIBC_2.17' => 0,
                                                          'malloc@GLIBC_2.17' => 0,
                                                          'memcmp@GLIBC_2.17' => 0,
                                                          'memcpy@GLIBC_2.17' => 0,
                                                          'open64@GLIBC_2.17' => 0,
                                                          'poll@GLIBC_2.17' => 0,
                                                          'recv@GLIBC_2.17' => 0,
                                                          'recvmsg@GLIBC_2.17' => 0,
                                                          'sendmsg@GLIBC_2.17' => 0,
                                                          'sendto@GLIBC_2.17' => 0,
                                                          'setsockopt@GLIBC_2.17' => 0,
                                                          'socket@GLIBC_2.17' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.17' => 0,
                                                          'strtol@GLIBC_2.17' => 0,
                                                          'write@GLIBC_2.17' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
