$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'AARCH64',
          'GccVersion' => '13.1.1',
          'Headers' => {
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'file_io.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'pdr_oem_ibm.h' => 1,
                         'platform.h' => 1,
                         'platform_oem_ibm.h' => 1,
                         'pldm.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.6.0',
          'LibraryVersion' => '0.6.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {},
          'SymbolInfo' => {
                            '10023' => {
                                         'Header' => 'bios.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'instance_id',

                                                 'pldm_get_entity_from_record_handle' => 1,
                                                 'pldm_instance_db_destroy' => 1,
                                                 'pldm_instance_db_init' => 1,
                                                 'pldm_instance_db_init_default' => 1,
                                                 'pldm_instance_id_alloc' => 1,
                                                 'pldm_instance_id_free' => 1,
                                                 'pldm_is_current_parent_child' => 1,
                                                 'pldm_is_empty_entity_assoc_tree' => 1,
                                                 'pldm_open' => 1,
                                                 'pldm_pdr_add_after_prev_record' => 1,
                                                 'pldm_pdr_add_check' => 1,
                                                 'pldm_pdr_add_fru_record_set_check' => 1,
                                                 'pldm_pdr_add_hotplug_record' => 1,
                                                 'pldm_pdr_destroy' => 1,
                                                 'pldm_pdr_find_last_local_record' => 1,
                                                 'pldm_pdr_find_prev_record_handle' => 1,
                                                 'pldm_pdr_find_record' => 1,
                                                 'pldm_pdr_find_record_by_type' => 1,
                                                 'pldm_pdr_fru_record_set_find_by_rsi' => 1,
                                                 'pldm_pdr_get_next_record' => 1,
                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'pldm_transport_mctp_demux_destroy' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100122' => {
                                        'Header' => undef,
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'prev',
                                                             'offset' => '0',
                                                             'type' => '99745'
                                                           },
                                                    '1' => {
                                                             'name' => 'allocations',
                                                             'offset' => '4',
                                                             'type' => '180'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_tid_state',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '100161' => {
                                        'Header' => undef,
                                        'Line' => '23',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'state',
                                                             'offset' => '0',
                                                             'type' => '100203'
                                                           },
                                                    '1' => {
                                                             'name' => 'lock_db_fd',
                                                             'offset' => '8264',
                                                             'type' => '74'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_instance_db',
                                        'PrivateABI' => 1,
                                        'Size' => '2052',
                                        'Type' => 'Struct'
                                      },
                          '100203' => {
                                        'BaseType' => '100122',
                                        'Name' => 'struct pldm_tid_state[256]',
                                        'Size' => '2048',
                                        'Type' => 'Array'
                                      },
                          '100616' => {
                                        'BaseType' => '100161',
                                        'Name' => 'struct pldm_instance_db*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '101022' => {
                                        'BaseType' => '99745',
                                        'Name' => 'pldm_instance_id_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '101198' => {
                                        'BaseType' => '100616',
                                        'Name' => 'struct pldm_instance_db**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '101688' => {
                                        'BaseType' => '168',
                                        'Header' => 'pldm.h',
                                        'Line' => '12',
                                        'Name' => 'mctp_eid_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '101700' => {
                                        'Header' => 'pldm.h',
                                        'Line' => '14',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_REQUESTER_SUCCESS',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                             'value' => '18446744073709551615 (-1)'
                                                           },
                                                    '10' => {
                                                              'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                              'value' => '18446744073709551606 (-10)'
                                                            },
                                                    '11' => {
                                                              'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                              'value' => '18446744073709551605 (-11)'
                                                            },
                                                    '12' => {
                                                              'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                              'value' => '18446744073709551604 (-12)'
                                                            },
                                                    '13' => {
                                                              'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                              'value' => '18446744073709551603 (-13)'
                                                            },
                                                    '2' => {
                                                             'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                             'value' => '18446744073709551614 (-2)'
                                                           },
                                                    '3' => {
                                                             'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                             'value' => '18446744073709551613 (-3)'
                                                           },
                                                    '4' => {
                                                             'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                             'value' => '18446744073709551612 (-4)'
                                                           },
                                                    '5' => {
                                                             'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                             'value' => '18446744073709551611 (-5)'
                                                           },
                                                    '6' => {
                                                             'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                             'value' => '18446744073709551610 (-6)'
                                                           },
                                                    '7' => {
                                                             'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                             'value' => '18446744073709551609 (-7)'
                                                           },
                                                    '8' => {
                                                             'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                             'value' => '18446744073709551608 (-8)'
                                                           },
                                                    '9' => {
                                                             'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                             'value' => '18446744073709551607 (-9)'
                                                           }
                                                  },
                                        'Name' => 'enum pldm_requester_error_codes',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '101803' => {
                                        'BaseType' => '101700',
                                        'Header' => 'pldm.h',
                                        'Line' => '29',
                                        'Name' => 'pldm_requester_rc_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '101946' => {
                                        'Header' => undef,
                                        'Line' => '23',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '102019'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '74'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '105320'
                                                           },
                                                    '3' => {
                                                             'name' => 'socket_send_buf',
                                                             'offset' => '768',
                                                             'type' => '104462'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_mctp_demux',
                                        'PrivateABI' => 1,
                                        'Size' => '312',
                                        'Type' => 'Struct'
                                      },
                          '101972' => {
                                        'BaseType' => '101946',
                                        'Name' => 'struct pldm_transport_mctp_demux*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '102' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '102014' => {
                                        'BaseType' => '102019',
                                        'Name' => 'struct pldm_transport*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '102019' => {
                                        'Header' => undef,
                                        'Line' => '17',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '12199'
                                                           },
                                                    '1' => {
                                                             'name' => 'version',
                                                             'offset' => '8',
                                                             'type' => '168'
                                                           },
                                                    '2' => {
                                                             'name' => 'recv',
                                                             'offset' => '22',
                                                             'type' => '104647'
                                                           },
                                                    '3' => {
                                                             'name' => 'send',
                                                             'offset' => '36',
                                                             'type' => '104688'
                                                           },
                                                    '4' => {
                                                             'name' => 'init_pollfd',
                                                             'offset' => '50',
                                                             'type' => '104769'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '102155' => {
                                        'BaseType' => '99733',
                                        'Name' => 'pldm_tid_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '104462' => {
                                        'Header' => undef,
                                        'Line' => '4',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'size',
                                                             'offset' => '0',
                                                             'type' => '74'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '4',
                                                             'type' => '74'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '74'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_socket_sndbuf',
                                        'PrivateABI' => 1,
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '104647' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '102014'
                                                            },
                                                     '1' => {
                                                              'type' => '102155'
                                                            },
                                                     '2' => {
                                                              'type' => '16623'
                                                            },
                                                     '3' => {
                                                              'type' => '8822'
                                                            }
                                                   },
                                        'Return' => '101803',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '104688' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '102014'
                                                            },
                                                     '1' => {
                                                              'type' => '99733'
                                                            },
                                                     '2' => {
                                                              'type' => '1434'
                                                            },
                                                     '3' => {
                                                              'type' => '123'
                                                            }
                                                   },
                                        'Return' => '101803',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '104713' => {
                                        'BaseType' => '104718',
                                        'Name' => 'struct pollfd*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '104718' => {
                                        'Header' => undef,
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'fd',
                                                             'offset' => '0',
                                                             'type' => '74'
                                                           },
                                                    '1' => {
                                                             'name' => 'events',
                                                             'offset' => '4',
                                                             'type' => '60'
                                                           },
                                                    '2' => {
                                                             'name' => 'revents',
                                                             'offset' => '6',
                                                             'type' => '60'
                                                           }
                                                  },
                                        'Name' => 'struct pollfd',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '104769' => {
                                        'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '102014'
                                                            },
                                                     '1' => {
                                                              'type' => '104713'
                                                            }
                                                   },
                                        'Return' => '74',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '105320' => {
                                        'BaseType' => '99733',
                                        'Name' => 'pldm_tid_t[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '109' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '11261' => {
                                       'BaseType' => '116',
                                       'Name' => 'char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11278' => {
                                       'BaseType' => '116',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '11295' => {
                                       'BaseType' => '123',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '11307' => {
                                       'BaseType' => '46',
                                       'Header' => undef,
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11381' => {
                                       'BaseType' => '109',
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11393' => {
                                       'BaseType' => '11307',
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11458' => {
                                       'BaseType' => '4895',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '11475' => {
                                       'BaseType' => '180',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '116' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '11646' => {
                                       'BaseType' => '168',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '31',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11658' => {
                                       'BaseType' => '446',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '163',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12199' => {
                                       'BaseType' => '11278',
                                       'Name' => 'char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12204' => {
                                       'BaseType' => '11381',
                                       'Header' => undef,
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '123' => {
                                     'BaseType' => '102',
                                     'Header' => undef,
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '12747' => {
                                       'Header' => 'platform.h',
                                       'Line' => '243',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12781' => {
                                       'BaseType' => '12747',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13004' => {
                                       'Header' => 'platform.h',
                                       'Line' => '461',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '13083' => {
                                       'Header' => 'platform.h',
                                       'Line' => '536',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13004'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '4895'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '4895'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '4895'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '168'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '11646'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '13227' => {
                                       'Header' => 'platform.h',
                                       'Line' => '553',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13285'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '13280' => {
                                       'BaseType' => '13227',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13301' => {
                                       'Header' => 'platform.h',
                                       'Line' => '563',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13004'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '4895'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '874'
                                                           },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '4895'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '4895'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '4895'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '11646'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '13658' => {
                                       'Header' => 'platform.h',
                                       'Line' => '718',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '13737' => {
                                       'Header' => undef,
                                       'Line' => '736',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '13771' => {
                                       'Header' => 'platform.h',
                                       'Line' => '731',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13658'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '4895'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '168'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '168'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '168'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '11393'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '168'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '168'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '168'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '11646'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '168'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '11658'
                                                           },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '4895'
                                                          },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '11658'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '4895'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '168'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '168'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '13646'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '11634'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '11634'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '11658'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '11658'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '13646'
                                                           },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '4895'
                                                          },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '13646'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '168'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '11634'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '13552'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '13552'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '13552'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '13552'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '13552'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '13552'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '13552'
                                                           },
                                                   '4' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '13737'
                                                          },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '13552'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '13552'
                                                           },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '4895'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '11646'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '11393'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '142' => {
                                     'BaseType' => '53',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '14324' => {
                                       'Header' => 'platform.h',
                                       'Line' => '783',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13285'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '1434' => {
                                      'BaseType' => '1439',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '14377' => {
                                       'BaseType' => '14324',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14382' => {
                                       'Header' => 'platform.h',
                                       'Line' => '831',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '1439' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '14422' => {
                                       'BaseType' => '14382',
                                       'Header' => 'platform.h',
                                       'Line' => '834',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '14434' => {
                                       'Header' => 'platform.h',
                                       'Line' => '840',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14500' => {
                                       'BaseType' => '14434',
                                       'Header' => 'platform.h',
                                       'Line' => '848',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '14699' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '15181' => {
                                       'Header' => 'platform.h',
                                       'Line' => '985',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15393' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1066',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '154' => {
                                     'BaseType' => '81',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1615' => {
                                      'BaseType' => '830',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '166' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '16623' => {
                                       'BaseType' => '166',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '168' => {
                                     'BaseType' => '142',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '180' => {
                                     'BaseType' => '154',
                                     'Header' => undef,
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2029' => {
                                      'BaseType' => '869',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2034' => {
                                      'BaseType' => '168',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2039' => {
                                      'BaseType' => '180',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '20647' => {
                                       'BaseType' => '8822',
                                       'Name' => 'size_t*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '22190' => {
                                       'BaseType' => '22200',
                                       'Name' => 'uint32_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22195' => {
                                       'BaseType' => '11475',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22200' => {
                                       'BaseType' => '22195',
                                       'Name' => 'uint32_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '22205' => {
                                       'BaseType' => '15393',
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2811' => {
                                      'BaseType' => '429',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '28529' => {
                                       'BaseType' => '13771',
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3250' => {
                                      'BaseType' => '441',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '34839' => {
                                       'BaseType' => '15181',
                                       'Name' => 'struct pldm_sensor_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34844' => {
                                       'BaseType' => '34839',
                                       'Name' => 'struct pldm_sensor_event_data*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '35809' => {
                                       'BaseType' => '14500',
                                       'Name' => 'get_sensor_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '363' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '24',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'major',
                                                          'offset' => '0',
                                                          'type' => '168'
                                                        },
                                                 '1' => {
                                                          'name' => 'minor',
                                                          'offset' => '1',
                                                          'type' => '168'
                                                        },
                                                 '2' => {
                                                          'name' => 'update',
                                                          'offset' => '2',
                                                          'type' => '168'
                                                        },
                                                 '3' => {
                                                          'name' => 'alpha',
                                                          'offset' => '3',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '40847' => {
                                       'BaseType' => '14422',
                                       'Name' => 'set_effecter_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41647' => {
                                       'BaseType' => '13083',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41652' => {
                                       'BaseType' => '41647',
                                       'Name' => 'struct pldm_state_sensor_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '41657' => {
                                       'BaseType' => '13280',
                                       'Name' => 'struct state_sensor_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41662' => {
                                       'BaseType' => '41657',
                                       'Name' => 'struct state_sensor_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '41979' => {
                                       'BaseType' => '13301',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41984' => {
                                       'BaseType' => '41979',
                                       'Name' => 'struct pldm_state_effecter_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '41989' => {
                                       'BaseType' => '14377',
                                       'Name' => 'struct state_effecter_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41994' => {
                                       'BaseType' => '41989',
                                       'Name' => 'struct state_effecter_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '429' => {
                                     'BaseType' => '363',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '29',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '441' => {
                                     'BaseType' => '429',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '446' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '45503' => {
                                       'BaseType' => '102',
                                       'Header' => undef,
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '4558' => {
                                      'BaseType' => '825',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '45592' => {
                                       'BaseType' => '45503',
                                       'Header' => undef,
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '45604' => {
                                       'Header' => 'bios.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '4563' => {
                                      'BaseType' => '890',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '45638' => {
                                       'Header' => 'bios.h',
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '4895'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '45695'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '45690' => {
                                       'BaseType' => '45638',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '45695' => {
                                       'BaseType' => '116',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '45711' => {
                                       'Header' => 'bios.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '45776' => {
                                       'BaseType' => '45711',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '45797' => {
                                       'Header' => 'bios.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '45849' => {
                                       'BaseType' => '45797',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '45918' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6265'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '46021'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '6087'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '46' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '46009' => {
                                       'BaseType' => '45918',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '46021' => {
                                       'BaseType' => '11458',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46031' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '292',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6265'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '4895'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '4895'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '4895'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '12199'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '46143' => {
                                       'BaseType' => '46031',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '46153' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '382',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6265'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '45592'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '45592'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '180'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '45592'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '46251' => {
                                       'BaseType' => '46153',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '4653' => {
                                      'BaseType' => '969',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4658' => {
                                      'BaseType' => '714',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '46607' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1434'
                                                           }
                                                  },
                                       'Return' => '12204',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '46677' => {
                                       'Header' => undef,
                                       'Line' => '935',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '6087'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '123'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '123'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '46607'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '46747' => {
                                       'BaseType' => '46677',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '47758' => {
                                       'BaseType' => '46677',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47763' => {
                                       'BaseType' => '45849',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '48178' => {
                                       'BaseType' => '45776',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4838' => {
                                      'BaseType' => '67',
                                      'Header' => undef,
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '48767' => {
                                       'BaseType' => '45690',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4890' => {
                                      'BaseType' => '168',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '4895' => {
                                      'BaseType' => '4838',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '49940' => {
                                       'BaseType' => '46747',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '53709' => {
                                       'BaseType' => '45592',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53986' => {
                                       'BaseType' => '46251',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54253' => {
                                       'BaseType' => '12199',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55303' => {
                                       'BaseType' => '46143',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56665' => {
                                       'BaseType' => '46009',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '6048' => {
                                      'Header' => 'utils.h',
                                      'Line' => '18',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '6087'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '123'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6087' => {
                                      'BaseType' => '4890',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '61926' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '329',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '62030'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '14699'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '4895'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '62030' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '62062' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '343',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '59429'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '168'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '62257' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '377',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '4895'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '58931'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '58931'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '180'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '180'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '168'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '62439' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '403',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '59429'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '168'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '62543' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '417',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '4895'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '62725'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '58931'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '59429'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '180'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '62725'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '180'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '6265' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '62725' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '63585' => {
                                       'BaseType' => '6048',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '63930' => {
                                       'BaseType' => '11646',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '6481' => {
                                      'BaseType' => '6048',
                                      'Name' => 'struct variable_field*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '66940' => {
                                       'BaseType' => '63585',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '68221' => {
                                       'BaseType' => '62543',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68451' => {
                                       'BaseType' => '62439',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68749' => {
                                       'BaseType' => '2034',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69043' => {
                                       'BaseType' => '62257',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69666' => {
                                       'BaseType' => '62062',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69818' => {
                                       'BaseType' => '61926',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '714' => {
                                     'Header' => 'base.h',
                                     'Line' => '117',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '74' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '76123' => {
                                       'Header' => 'pdr_data.h',
                                       'Line' => '12',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '2034'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '76212'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '6265'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '76212' => {
                                       'BaseType' => '76123',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76224' => {
                                       'BaseType' => '76123',
                                       'Header' => 'pdr_data.h',
                                       'Line' => '19',
                                       'Name' => 'pldm_pdr_record',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '76236' => {
                                       'BaseType' => '76224',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '76241' => {
                                       'Header' => 'pdr_data.h',
                                       'Line' => '21',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '76301'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '76301'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '76301' => {
                                       'BaseType' => '76224',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76306' => {
                                       'BaseType' => '76241',
                                       'Header' => 'pdr_data.h',
                                       'Line' => '26',
                                       'Name' => 'pldm_pdr',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '76318' => {
                                       'BaseType' => '76306',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '76323' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '398',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '4895'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '4895'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '76380' => {
                                       'BaseType' => '76323',
                                       'Header' => 'pdr.h',
                                       'Line' => '402',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '76422' => {
                                       'BaseType' => '76435',
                                       'Header' => undef,
                                       'Line' => '412',
                                       'Name' => 'pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '76435' => {
                                       'Header' => undef,
                                       'Line' => '927',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '78484'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '4895'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '76478' => {
                                       'BaseType' => '76496',
                                       'Header' => undef,
                                       'Line' => '417',
                                       'Name' => 'pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '76491' => {
                                       'BaseType' => '76478',
                                       'Name' => 'pldm_entity_node const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '76496' => {
                                       'Header' => undef,
                                       'Line' => '932',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '76380'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '76380'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_container_id',
                                                            'offset' => '18',
                                                            'type' => '4895'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '78484'
                                                          },
                                                   '4' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '78484'
                                                          },
                                                   '5' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '78484' => {
                                       'BaseType' => '76478',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78562' => {
                                       'BaseType' => '76318',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79121' => {
                                       'BaseType' => '79126',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79126' => {
                                       'BaseType' => '76380',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79196' => {
                                       'BaseType' => '76422',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79475' => {
                                       'BaseType' => '78484',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80536' => {
                                       'BaseType' => '76306',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '825' => {
                                     'BaseType' => '714',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '8294' => {
                                      'BaseType' => '4895',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '830' => {
                                     'Header' => 'base.h',
                                     'Line' => '150',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '714'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '874'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '869' => {
                                     'BaseType' => '830',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '874' => {
                                     'BaseType' => '168',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '87933' => {
                                       'BaseType' => '76491',
                                       'Name' => 'pldm_entity_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8822' => {
                                      'BaseType' => '123',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '890' => {
                                     'Header' => 'base.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '702'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '168'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '168'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '168'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '91602' => {
                                       'BaseType' => '76236',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '969' => {
                                     'BaseType' => '890',
                                     'Name' => 'struct pldm_header_info const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '99733' => {
                                       'BaseType' => '168',
                                       'Header' => 'base.h',
                                       'Line' => '14',
                                       'Name' => 'pldm_tid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '99745' => {
                                       'BaseType' => '168',
                                       'Header' => 'instance-id.h',
                                       'Line' => '11',
                                       'Name' => 'pldm_instance_id_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.6.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.17' => 0,
                                                          '__cxa_finalize@GLIBC_2.17' => 0,
                                                          '__errno_location@GLIBC_2.17' => 0,
                                                          '__gmon_start__' => 0,
                                                          'calloc@GLIBC_2.17' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.17' => 0,
                                                          'connect@GLIBC_2.17' => 0,
                                                          'dup@GLIBC_2.17' => 0,
                                                          'fclose@GLIBC_2.17' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'fgets@GLIBC_2.17' => 0,
                                                          'fopen64@GLIBC_2.17' => 0,
                                                          'free@GLIBC_2.17' => 0,
                                                          'getsockopt@GLIBC_2.17' => 0,
                                                          'malloc@GLIBC_2.17' => 0,
                                                          'memcmp@GLIBC_2.17' => 0,
                                                          'memcpy@GLIBC_2.17' => 0,
                                                          'open64@GLIBC_2.17' => 0,
                                                          'poll@GLIBC_2.17' => 0,
                                                          'ppoll@GLIBC_2.17' => 0,
                                                          'recv@GLIBC_2.17' => 0,
                                                          'recvfrom@GLIBC_2.17' => 0,
                                                          'recvmsg@GLIBC_2.17' => 0,
                                                          'sendmsg@GLIBC_2.17' => 0,
                                                          'sendto@GLIBC_2.17' => 0,
                                                          'setsockopt@GLIBC_2.17' => 0,
                                                          'socket@GLIBC_2.17' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.17' => 0,
                                                          'strtol@GLIBC_2.17' => 0,
                                                          'timerfd_create@GLIBC_2.17' => 0,
                                                          'timerfd_settime@GLIBC_2.17' => 0,
                                                          'write@GLIBC_2.17' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
